Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_radio.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; nrf5340_network_radio.
; ======================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     nrf5340_network_radio equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// RADIO address definitions
// -------------------------

typedef struct {
    volatile    uint32_t    TASKS_TXEN;
    volatile    uint32_t    TASKS_RXEN;
    volatile    uint32_t    TASKS_START;
    volatile    uint32_t    TASKS_STOP;
    volatile    uint32_t    TASKS_DISABLE;
    volatile    uint32_t    TASKS_RSSISTART;
    volatile    uint32_t    TASKS_RSSISTOP;
    volatile    uint32_t    TASKS_BCSTART;
    volatile    uint32_t    TASKS_BCSTOP;
    volatile    uint32_t    TASKS_EDSTART;
    volatile    uint32_t    TASKS_EDSTOP;
    volatile    uint32_t    TASKS_CCASTART;
    volatile    uint32_t    TASKS_CCASTOP;
    volatile    uint32_t    RESERVED0[19];
    volatile    uint32_t    SUBSCRIBE_TXEN;
    volatile    uint32_t    SUBSCRIBE_RXEN;
    volatile    uint32_t    SUBSCRIBE_START;
    volatile    uint32_t    SUBSCRIBE_STOP;
    volatile    uint32_t    SUBSCRIBE_DISABLE;
    volatile    uint32_t    SUBSCRIBE_RSSISTART;
    volatile    uint32_t    SUBSCRIBE_RSSISTOP;
    volatile    uint32_t    SUBSCRIBE_BCSTART;
    volatile    uint32_t    SUBSCRIBE_BCSTOP;
    volatile    uint32_t    SUBSCRIBE_EDSTART;
    volatile    uint32_t    SUBSCRIBE_EDSTOP;
    volatile    uint32_t    SUBSCRIBE_CCASTART;
    volatile    uint32_t    SUBSCRIBE_CCASTOP;
    volatile    uint32_t    RESERVED1[19];
    volatile    uint32_t    EVENTS_READY;
    volatile    uint32_t    EVENTS_ADDRESS;
    volatile    uint32_t    EVENTS_PAYLOAD;
    volatile    uint32_t    EVENTS_END;
    volatile    uint32_t    EVENTS_DISABLED;
    volatile    uint32_t    EVENTS_DEVMATCH;
    volatile    uint32_t    EVENTS_DEVMISS;
    volatile    uint32_t    EVENTS_RSSIEND;
    volatile    uint32_t    RESERVED2[2];
    volatile    uint32_t    EVENTS_BCMATCH;
    volatile    uint32_t    RESERVED3;
    volatile    uint32_t    EVENTS_CRCOK;
    volatile    uint32_t    EVENTS_CRCERROR;
    volatile    uint32_t    EVENTS_FRAMESTART;
    volatile    uint32_t    EVENTS_EDEND;
    volatile    uint32_t    EVENTS_EDSTOPPED;
    volatile    uint32_t    EVENTS_CCAIDLE;
    volatile    uint32_t    EVENTS_CCABUSY;
    volatile    uint32_t    EVENTS_CCASTOPPED;
    volatile    uint32_t    EVENTS_RATEBOOST;
    volatile    uint32_t    EVENTS_TXREADY;
    volatile    uint32_t    EVENTS_RXREADY;
    volatile    uint32_t    EVENTS_MHRMATCH;
    volatile    uint32_t    RESERVED4[2];
    volatile    uint32_t    EVENTS_SYNC;
    volatile    uint32_t    EVENTS_PHYEND;
    volatile    uint32_t    EVENTS_CTEPRESENT;
    volatile    uint32_t    RESERVED5[3];
    volatile    uint32_t    PUBLISH_READY;
    volatile    uint32_t    PUBLISH_ADDRESS;
    volatile    uint32_t    PUBLISH_PAYLOAD;
    volatile    uint32_t    PUBLISH_END;
    volatile    uint32_t    PUBLISH_DISABLED;
    volatile    uint32_t    PUBLISH_DEVMATCH;
    volatile    uint32_t    PUBLISH_DEVMISS;
    volatile    uint32_t    PUBLISH_RSSIEND;
    volatile    uint32_t    RESERVED6[2];
    volatile    uint32_t    PUBLISH_BCMATCH;
    volatile    uint32_t    RESERVED7;
    volatile    uint32_t    PUBLISH_CRCOK;
    volatile    uint32_t    PUBLISH_CRCERROR;
    volatile    uint32_t    PUBLISH_FRAMESTART;
    volatile    uint32_t    PUBLISH_EDEND;
    volatile    uint32_t    PUBLISH_EDSTOPPED;
    volatile    uint32_t    PUBLISH_CCAIDLE;
    volatile    uint32_t    PUBLISH_CCABUSY;
    volatile    uint32_t    PUBLISH_CCASTOPPED;
    volatile    uint32_t    PUBLISH_RATEBOOST;
    volatile    uint32_t    PUBLISH_TXREADY;
    volatile    uint32_t    PUBLISH_RXREADY;
    volatile    uint32_t    PUBLISH_MHRMATCH;
    volatile    uint32_t    RESERVED8[2];
    volatile    uint32_t    PUBLISH_SYNC;
    volatile    uint32_t    PUBLISH_PHYEND;
    volatile    uint32_t    PUBLISH_CTEPRESENT;
    volatile    uint32_t    RESERVED9[3];
    volatile    uint32_t    SHORTS;
    volatile    uint32_t    RESERVED10[64];
    volatile    uint32_t    INTENSET;
    volatile    uint32_t    INTENCLR;
    volatile    uint32_t    RESERVED11[61];
    volatile    uint32_t    CRCSTATUS;
    volatile    uint32_t    RESERVED12;
    volatile    uint32_t    RXMATCH;
    volatile    uint32_t    RXCRC;
    volatile    uint32_t    DAI;
    volatile    uint32_t    PDUSTAT;
    volatile    uint32_t    RESERVED13[13];
    volatile    uint32_t    CTESTATUS;
    volatile    uint32_t    RESERVED14[2];
    volatile    uint32_t    DFESTATUS;
    volatile    uint32_t    RESERVED15[42];
    volatile    uint32_t    PACKETPTR;
    volatile    uint32_t    FREQUENCY;
    volatile    uint32_t    TXPOWER;
    volatile    uint32_t    MODE;
    volatile    uint32_t    PCNF0;
    volatile    uint32_t    PCNF1;
    volatile    uint32_t    BASE0;
    volatile    uint32_t    BASE1;
    volatile    uint32_t    PREFIX0;
    volatile    uint32_t    PREFIX1;
    volatile    uint32_t    TXADDRESS;
    volatile    uint32_t    RXADDRESSES;
    volatile    uint32_t    CRCCNF;
    volatile    uint32_t    CRCPOLY;
    volatile    uint32_t    CRCINIT;
    volatile    uint32_t    RESERVED16;
    volatile    uint32_t    TIFS;
    volatile    uint32_t    RSSISAMPLE;
    volatile    uint32_t    RESERVED17;
    volatile    uint32_t    STATE;
    volatile    uint32_t    DATAWHITEIV;
    volatile    uint32_t    RESERVED18[2];
    volatile    uint32_t    BCC;
    volatile    uint32_t    RESERVED19[39];
    volatile    uint32_t    DAB[8];
    volatile    uint32_t    DAP[8];
    volatile    uint32_t    DACNF;
    volatile    uint32_t    MHRMATCHCONF;
    volatile    uint32_t    MHRMATCHMAS;
    volatile    uint32_t    RESERVED20;
    volatile    uint32_t    MODECNF0;
    volatile    uint32_t    RESERVED21[3];
    volatile    uint32_t    SFD;
    volatile    uint32_t    EDCNT;
    volatile    uint32_t    EDSAMPLE;
    volatile    uint32_t    CCACTRL;
    volatile    uint32_t    RESERVED22[164];
    volatile    uint32_t    DFEMODE;
    volatile    uint32_t    CTEINLINECONF;
    volatile    uint32_t    RESERVED23[2];
    volatile    uint32_t    DFECTRL1;
    volatile    uint32_t    DFECTRL2;
    volatile    uint32_t    RESERVED24[4];
    volatile    uint32_t    SWITCHPATTERN;
    volatile    uint32_t    CLEARPATTERN;
    volatile    uint32_t    PSEL_DFEGPIO[8];
    volatile    uint32_t    DFEPACKET_PTR;
    volatile    uint32_t    DFEPACKET_MAXCNT;
    volatile    uint32_t    DFEPACKET_AMOUNT;
    volatile    uint32_t    RESERVED25[424];
    volatile    uint32_t    POWER;
} RADIO_TypeDef;

#ifdef __cplusplus
#define RADIO_NS    reinterpret_cast<RADIO_TypeDef *>(0x41008000U)

#else
#define RADIO_NS    ((RADIO_TypeDef *)0x41008000U)
#endif

// TASKS_TXEN Configuration

#define RADIO_TASKS_TXEN_TASKS_TXEN                             (0x1U<<0)
#define RADIO_TASKS_TXEN_TASKS_TXEN_TRIGGER                     (0x1U<<0)

// TASKS_RXEN Configuration

