Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_radio.h
#define RADIO_TASKS_RXEN_TASKS_RXEN                             (0x1U<<0)
#define RADIO_TASKS_RXEN_TASKS_RXEN_TRIGGER                     (0x1U<<0)

// TASKS_START Configuration

#define RADIO_TASKS_START_TASKS_START                           (0x1U<<0)
#define RADIO_TASKS_START_TASKS_START_TRIGGER                   (0x1U<<0)

// TASKS_STOP Configuration

#define RADIO_TASKS_STOP_TASKS_STOP                             (0x1U<<0)
#define RADIO_TASKS_STOP_TASKS_STOP_TRIGGER                     (0x1U<<0)

// TASKS_DISABLE Configuration

#define RADIO_TASKS_DISABLE_TASKS_DISABLE                       (0x1U<<0)
#define RADIO_TASKS_DISABLE_TASKS_DISABLE_TRIGGER               (0x1U<<0)

// TASKS_RSSISTART Configuration

#define RADIO_TASKS_RSSISTART_TASKS_RSSISTART                   (0x1U<<0)
#define RADIO_TASKS_RSSISTART_TASKS_RSSISTART_TRIGGER           (0x1U<<0)

// TASKS_RSSISTOP Configuration

#define RADIO_TASKS_RSSISTOP_TASKS_RSSISTOP                     (0x1U<<0)
#define RADIO_TASKS_RSSISTOP_TASKS_RSSISTOP_TRIGGER             (0x1U<<0)

// TASKS_BCSTART Configuration

#define RADIO_TASKS_BCSTART_TASKS_BCSTART                       (0x1U<<0)
#define RADIO_TASKS_BCSTART_TASKS_BCSTART_TRIGGER               (0x1U<<0)

// TASKS_BCSTOP Configuration

#define RADIO_TASKS_BCSTOP_TASKS_BCSTOP                         (0x1U<<0)
#define RADIO_TASKS_BCSTOP_TASKS_BCSTOP_TRIGGER                 (0x1U<<0)

// TASKS_EDSTART Configuration

#define RADIO_TASKS_EDSTART_TASKS_EDSTART                       (0x1U<<0)
#define RADIO_TASKS_EDSTART_TASKS_EDSTART_TRIGGER               (0x1U<<0)

// TASKS_EDSTOP Configuration

#define RADIO_TASKS_EDSTOP_TASKS_EDSTOP                         (0x1U<<0)
#define RADIO_TASKS_EDSTOP_TASKS_EDSTOP_TRIGGER                 (0x1U<<0)

// TASKS_CCASTART Configuration

#define RADIO_TASKS_CCASTART_TASKS_CCASTART                     (0x1U<<0)
#define RADIO_TASKS_CCASTART_TASKS_CCASTART_TRIGGER             (0x1U<<0)

// TASKS_CCASTOP Configuration

#define RADIO_TASKS_CCASTOP_TASKS_CCASTOP                       (0x1U<<0)
#define RADIO_TASKS_CCASTOP_TASKS_CCASTOP_TRIGGER               (0x1U<<0)

// SUBSCRIBE_TXEN Configuration

#define RADIO_SUBSCRIBE_TXEN_EN                                 (0x1U<<31)
#define RADIO_SUBSCRIBE_TXEN_CHIDX                              (0xFFU<<0)
#define RADIO_SUBSCRIBE_TXEN_CHIDX_0                            (0x1U<<0)
#define RADIO_SUBSCRIBE_TXEN_EN_DISABLED                        (0x0U<<31)
#define RADIO_SUBSCRIBE_TXEN_EN_ENABLED                         (0x1U<<31)

// SUBSCRIBE_RXEN Configuration

#define RADIO_SUBSCRIBE_RXEN_EN                                 (0x1U<<31)
#define RADIO_SUBSCRIBE_RXEN_CHIDX                              (0xFFU<<0)
#define RADIO_SUBSCRIBE_RXEN_CHIDX_0                            (0x1U<<0)
#define RADIO_SUBSCRIBE_RXEN_EN_DISABLED                        (0x0U<<31)
#define RADIO_SUBSCRIBE_RXEN_EN_ENABLED                         (0x1U<<31)

// SUBSCRIBE_START Configuration

#define RADIO_SUBSCRIBE_START_EN                                (0x1U<<31)
#define RADIO_SUBSCRIBE_START_CHIDX                             (0xFFU<<0)
#define RADIO_SUBSCRIBE_START_CHIDX_0                           (0x1U<<0)
#define RADIO_SUBSCRIBE_START_EN_DISABLED                       (0x0U<<31)
#define RADIO_SUBSCRIBE_START_EN_ENABLED                        (0x1U<<31)

// SUBSCRIBE_STOP Configuration

#define RADIO_SUBSCRIBE_STOP_EN                                 (0x1U<<31)
#define RADIO_SUBSCRIBE_STOP_CHIDX                              (0xFFU<<0)
#define RADIO_SUBSCRIBE_STOP_CHIDX_0                            (0x1U<<0)
#define RADIO_SUBSCRIBE_STOP_EN_DISABLED                        (0x0U<<31)
#define RADIO_SUBSCRIBE_STOP_EN_ENABLED                         (0x1U<<31)

// SUBSCRIBE_DISABLE Configuration

#define RADIO_SUBSCRIBE_DISABLE_EN                              (0x1U<<31)
#define RADIO_SUBSCRIBE_DISABLE_CHIDX                           (0xFFU<<0)
#define RADIO_SUBSCRIBE_DISABLE_CHIDX_0                         (0x1U<<0)
#define RADIO_SUBSCRIBE_DISABLE_EN_DISABLED                     (0x0U<<31)
#define RADIO_SUBSCRIBE_DISABLE_EN_ENABLED                      (0x1U<<31)

// SUBSCRIBE_RSSISTART Configuration

#define RADIO_SUBSCRIBE_RSSISTART_EN                            (0x1U<<31)
#define RADIO_SUBSCRIBE_RSSISTART_CHIDX                         (0xFFU<<0)
#define RADIO_SUBSCRIBE_RSSISTART_CHIDX_0                       (0x1U<<0)
#define RADIO_SUBSCRIBE_RSSISTART_EN_DISABLED                   (0x0U<<31)
#define RADIO_SUBSCRIBE_RSSISTART_EN_ENABLED                    (0x1U<<31)

// SUBSCRIBE_RSSISTOP Configuration

#define RADIO_SUBSCRIBE_RSSISTOP_EN                             (0x1U<<31)
#define RADIO_SUBSCRIBE_RSSISTOP_CHIDX                          (0xFFU<<0)
#define RADIO_SUBSCRIBE_RSSISTOP_CHIDX_0                        (0x1U<<0)
#define RADIO_SUBSCRIBE_RSSISTOP_EN_DISABLED                    (0x0U<<31)
#define RADIO_SUBSCRIBE_RSSISTOP_EN_ENABLED                     (0x1U<<31)

// SUBSCRIBE_BCSTART Configuration

#define RADIO_SUBSCRIBE_BCSTART_EN                              (0x1U<<31)
#define RADIO_SUBSCRIBE_BCSTART_CHIDX                           (0xFFU<<0)
#define RADIO_SUBSCRIBE_BCSTART_CHIDX_0                         (0x1U<<0)
#define RADIO_SUBSCRIBE_BCSTART_EN_DISABLED                     (0x0U<<31)
#define RADIO_SUBSCRIBE_BCSTART_EN_ENABLED                      (0x1U<<31)

// SUBSCRIBE_BCSTOP Configuration

#define RADIO_SUBSCRIBE_BCSTOP_EN                               (0x1U<<31)
#define RADIO_SUBSCRIBE_BCSTOP_CHIDX                            (0xFFU<<0)
#define RADIO_SUBSCRIBE_BCSTOP_CHIDX_0                          (0x1U<<0)
#define RADIO_SUBSCRIBE_BCSTOP_EN_DISABLED                      (0x0U<<31)
#define RADIO_SUBSCRIBE_BCSTOP_EN_ENABLED                       (0x1U<<31)

// SUBSCRIBE_EDSTART Configuration

#define RADIO_SUBSCRIBE_EDSTART_EN                              (0x1U<<31)
#define RADIO_SUBSCRIBE_EDSTART_CHIDX                           (0xFFU<<0)
#define RADIO_SUBSCRIBE_EDSTART_CHIDX_0                         (0x1U<<0)
#define RADIO_SUBSCRIBE_EDSTART_EN_DISABLED                     (0x0U<<31)
#define RADIO_SUBSCRIBE_EDSTART_EN_ENABLED                      (0x1U<<31)

// SUBSCRIBE_EDSTOP Configuration

#define RADIO_SUBSCRIBE_EDSTOP_EN                               (0x1U<<31)
#define RADIO_SUBSCRIBE_EDSTOP_CHIDX                            (0xFFU<<0)
#define RADIO_SUBSCRIBE_EDSTOP_CHIDX_0                          (0x1U<<0)
#define RADIO_SUBSCRIBE_EDSTOP_EN_DISABLED                      (0x0U<<31)
#define RADIO_SUBSCRIBE_EDSTOP_EN_ENABLED                       (0x1U<<31)

