Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_radio.h
// SUBSCRIBE_CCASTART Configuration

#define RADIO_SUBSCRIBE_CCASTART_EN                             (0x1U<<31)
#define RADIO_SUBSCRIBE_CCASTART_CHIDX                          (0xFFU<<0)
#define RADIO_SUBSCRIBE_CCASTART_CHIDX_0                        (0x1U<<0)
#define RADIO_SUBSCRIBE_CCASTART_EN_DISABLED                    (0x0U<<31)
#define RADIO_SUBSCRIBE_CCASTART_EN_ENABLED                     (0x1U<<31)

// SUBSCRIBE_CCASTOP Configuration

#define RADIO_SUBSCRIBE_CCASTOP_EN                              (0x1U<<31)
#define RADIO_SUBSCRIBE_CCASTOP_CHIDX                           (0xFFU<<0)
#define RADIO_SUBSCRIBE_CCASTOP_CHIDX_0                         (0x1U<<0)
#define RADIO_SUBSCRIBE_CCASTOP_EN_DISABLED                     (0x0U<<31)
#define RADIO_SUBSCRIBE_CCASTOP_EN_ENABLED                      (0x1U<<31)

// EVENTS_READY Configuration

#define RADIO_EVENTS_READY_EVENTS_READY                         (0x1U<<0)
#define RADIO_EVENTS_READY_EVENTS_READY_NOTGENERATED            (0x0U<<0)
#define RADIO_EVENTS_READY_EVENTS_READY_GENERATED               (0x1U<<0)

// EVENTS_ADDRESS Configuration

#define RADIO_EVENTS_ADDRESS_EVENTS_ADDRESS                     (0x1U<<0)
#define RADIO_EVENTS_ADDRESS_EVENTS_ADDRESS_NOTGENERATED        (0x0U<<0)
#define RADIO_EVENTS_ADDRESS_EVENTS_ADDRESS_GENERATED           (0x1U<<0)

// EVENTS_PAYLOAD Configuration

#define RADIO_EVENTS_PAYLOAD_EVENTS_PAYLOAD                     (0x1U<<0)
#define RADIO_EVENTS_PAYLOAD_EVENTS_PAYLOAD_NOTGENERATED        (0x0U<<0)
#define RADIO_EVENTS_PAYLOAD_EVENTS_PAYLOAD_GENERATED           (0x1U<<0)

// EVENTS_END Configuration

#define RADIO_EVENTS_END_EVENTS_END                             (0x1U<<0)
#define RADIO_EVENTS_END_EVENTS_END_NOTGENERATED                (0x0U<<0)
#define RADIO_EVENTS_END_EVENTS_END_GENERATED                   (0x1U<<0)

// EVENTS_DISABLED Configuration

#define RADIO_EVENTS_DISABLED_EVENTS_DISABLED                   (0x1U<<0)
#define RADIO_EVENTS_DISABLED_EVENTS_DISABLED_NOTGENERATED      (0x0U<<0)
#define RADIO_EVENTS_DISABLED_EVENTS_DISABLED_GENERATED         (0x1U<<0)

// EVENTS_DEVMATCH Configuration

#define RADIO_EVENTS_DEVMATCH_EVENTS_DEVMATCH                   (0x1U<<0)
#define RADIO_EVENTS_DEVMATCH_EVENTS_DEVMATCH_NOTGENERATED      (0x0U<<0)
#define RADIO_EVENTS_DEVMATCH_EVENTS_DEVMATCH_GENERATED         (0x1U<<0)

// EVENTS_DEVMISS Configuration

#define RADIO_EVENTS_DEVMISS_EVENTS_DEVMISS                     (0x1U<<0)
#define RADIO_EVENTS_DEVMISS_EVENTS_DEVMISS_NOTGENERATED        (0x0U<<0)
#define RADIO_EVENTS_DEVMISS_EVENTS_DEVMISS_GENERATED           (0x1U<<0)

// EVENTS_RSSIEND Configuration

#define RADIO_EVENTS_RSSIEND_EVENTS_RSSIEND                     (0x1U<<0)
#define RADIO_EVENTS_RSSIEND_EVENTS_RSSIEND_NOTGENERATED        (0x0U<<0)
#define RADIO_EVENTS_RSSIEND_EVENTS_RSSIEND_GENERATED           (0x1U<<0)

// EVENTS_BCMATCH Configuration

#define RADIO_EVENTS_BCMATCH_EVENTS_BCMATCH                     (0x1U<<0)
#define RADIO_EVENTS_BCMATCH_EVENTS_BCMATCH_NOTGENERATED        (0x0U<<0)
#define RADIO_EVENTS_BCMATCH_EVENTS_BCMATCH_GENERATED           (0x1U<<0)

// EVENTS_CRCOK Configuration

#define RADIO_EVENTS_CRCOK_EVENTS_CRCOK                         (0x1U<<0)
#define RADIO_EVENTS_CRCOK_EVENTS_CRCOK_NOTGENERATED            (0x0U<<0)
#define RADIO_EVENTS_CRCOK_EVENTS_CRCOK_GENERATED               (0x1U<<0)

// EVENTS_CRCERROR Configuration

#define RADIO_EVENTS_CRCERROR_EVENTS_CRCERROR                   (0x1U<<0)
#define RADIO_EVENTS_CRCERROR_EVENTS_CRCERROR_NOTGENERATED      (0x0U<<0)
#define RADIO_EVENTS_CRCERROR_EVENTS_CRCERROR_GENERATED         (0x1U<<0)

// EVENTS_FRAMESTART Configuration

#define RADIO_EVENTS_FRAMESTART_EVENTS_FRAMESTART               (0x1U<<0)
#define RADIO_EVENTS_FRAMESTART_EVENTS_FRAMESTART_NOTGENERATED  (0x0U<<0)
#define RADIO_EVENTS_FRAMESTART_EVENTS_FRAMESTART_GENERATED     (0x1U<<0)

// EVENTS_EDEND Configuration

#define RADIO_EVENTS_EDEND_EVENTS_EDEND                         (0x1U<<0)
#define RADIO_EVENTS_EDEND_EVENTS_EDEND_NOTGENERATED            (0x0U<<0)
#define RADIO_EVENTS_EDEND_EVENTS_EDEND_GENERATED               (0x1U<<0)

// EVENTS_EDSTOPPED Configuration

#define RADIO_EVENTS_EDSTOPPED_EVENTS_EDSTOPPED                 (0x1U<<0)
#define RADIO_EVENTS_EDSTOPPED_EVENTS_EDSTOPPED_NOTGENERATED    (0x0U<<0)
#define RADIO_EVENTS_EDSTOPPED_EVENTS_EDSTOPPED_GENERATED       (0x1U<<0)

// EVENTS_CCAIDLE Configuration

#define RADIO_EVENTS_CCAIDLE_EVENTS_CCAIDLE                     (0x1U<<0)
#define RADIO_EVENTS_CCAIDLE_EVENTS_CCAIDLE_NOTGENERATED        (0x0U<<0)
#define RADIO_EVENTS_CCAIDLE_EVENTS_CCAIDLE_GENERATED           (0x1U<<0)

// EVENTS_CCABUSY Configuration

#define RADIO_EVENTS_CCABUSY_EVENTS_CCABUSY                     (0x1U<<0)
#define RADIO_EVENTS_CCABUSY_EVENTS_CCABUSY_NOTGENERATED        (0x0U<<0)
#define RADIO_EVENTS_CCABUSY_EVENTS_CCABUSY_GENERATED           (0x1U<<0)

// EVENTS_CCASTOPPED Configuration

#define RADIO_EVENTS_CCASTOPPED_EVENTS_CCASTOPPED               (0x1U<<0)
#define RADIO_EVENTS_CCASTOPPED_EVENTS_CCASTOPPED_NOTGENERATED  (0x0U<<0)
#define RADIO_EVENTS_CCASTOPPED_EVENTS_CCASTOPPED_GENERATED     (0x1U<<0)

// EVENTS_RATEBOOST Configuration

#define RADIO_EVENTS_RATEBOOST_EVENTS_RATEBOOST                 (0x1U<<0)
#define RADIO_EVENTS_RATEBOOST_EVENTS_RATEBOOST_NOTGENERATED    (0x0U<<0)
#define RADIO_EVENTS_RATEBOOST_EVENTS_RATEBOOST_GENERATED       (0x1U<<0)

// EVENTS_TXREADY Configuration

#define RADIO_EVENTS_TXREADY_EVENTS_TXREADY                     (0x1U<<0)
#define RADIO_EVENTS_TXREADY_EVENTS_TXREADY_NOTGENERATED        (0x0U<<0)
#define RADIO_EVENTS_TXREADY_EVENTS_TXREADY_GENERATED           (0x1U<<0)

// EVENTS_RXREADY Configuration

#define RADIO_EVENTS_RXREADY_EVENTS_RXREADY                     (0x1U<<0)
#define RADIO_EVENTS_RXREADY_EVENTS_RXREADY_NOTGENERATED        (0x0U<<0)
#define RADIO_EVENTS_RXREADY_EVENTS_RXREADY_GENERATED           (0x1U<<0)

// EVENTS_MHRMATCH Configuration

#define RADIO_EVENTS_MHRMATCH_EVENTS_MHRMATCH                   (0x1U<<0)
#define RADIO_EVENTS_MHRMATCH_EVENTS_MHRMATCH_NOTGENERATED      (0x0U<<0)
#define RADIO_EVENTS_MHRMATCH_EVENTS_MHRMATCH_GENERATED         (0x1U<<0)

// EVENTS_SYNC Configuration

#define RADIO_EVENTS_SYNC_EVENTS_SYNC                           (0x1U<<0)
#define RADIO_EVENTS_SYNC_EVENTS_SYNC_NOTGENERATED              (0x0U<<0)
#define RADIO_EVENTS_SYNC_EVENTS_SYNC_GENERATED                 (0x1U<<0)

// EVENTS_PHYEND Configuration

