Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_radio.h
#define RADIO_EVENTS_PHYEND_EVENTS_PHYEND                       (0x1U<<0)
#define RADIO_EVENTS_PHYEND_EVENTS_PHYEND_NOTGENERATED          (0x0U<<0)
#define RADIO_EVENTS_PHYEND_EVENTS_PHYEND_GENERATED             (0x1U<<0)

// EVENTS_CTEPRESENT Configuration

#define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT               (0x1U<<0)
#define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_NOTGENERATED  (0x0U<<0)
#define RADIO_EVENTS_CTEPRESENT_EVENTS_CTEPRESENT_GENERATED     (0x1U<<0)

// PUBLISH_READY Configuration

#define RADIO_PUBLISH_READY_EN                                  (0x1U<<31)
#define RADIO_PUBLISH_READY_CHIDX                               (0xFFU<<0)
#define RADIO_PUBLISH_READY_CHIDX_0                             (0x1U<<0)
#define RADIO_PUBLISH_READY_EN_DISABLED                         (0x0U<<31)
#define RADIO_PUBLISH_READY_EN_ENABLED                          (0x1U<<31)

// PUBLISH_ADDRESS Configuration

#define RADIO_PUBLISH_ADDRESS_EN                                (0x1U<<31)
#define RADIO_PUBLISH_ADDRESS_CHIDX                             (0xFFU<<0)
#define RADIO_PUBLISH_ADDRESS_CHIDX_0                           (0x1U<<0)
#define RADIO_PUBLISH_ADDRESS_EN_DISABLED                       (0x0U<<31)
#define RADIO_PUBLISH_ADDRESS_EN_ENABLED                        (0x1U<<31)

// PUBLISH_PAYLOAD Configuration

#define RADIO_PUBLISH_PAYLOAD_EN                                (0x1U<<31)
#define RADIO_PUBLISH_PAYLOAD_CHIDX                             (0xFFU<<0)
#define RADIO_PUBLISH_PAYLOAD_CHIDX_0                           (0x1U<<0)
#define RADIO_PUBLISH_PAYLOAD_EN_DISABLED                       (0x0U<<31)
#define RADIO_PUBLISH_PAYLOAD_EN_ENABLED                        (0x1U<<31)

// PUBLISH_END Configuration

#define RADIO_PUBLISH_END_EN                                    (0x1U<<31)
#define RADIO_PUBLISH_END_CHIDX                                 (0xFFU<<0)
#define RADIO_PUBLISH_END_CHIDX_0                               (0x1U<<0)
#define RADIO_PUBLISH_END_EN_DISABLED                           (0x0U<<31)
#define RADIO_PUBLISH_END_EN_ENABLED                            (0x1U<<31)

// PUBLISH_DISABLED Configuration

#define RADIO_PUBLISH_DISABLED_EN                               (0x1U<<31)
#define RADIO_PUBLISH_DISABLED_CHIDX                            (0xFFU<<0)
#define RADIO_PUBLISH_DISABLED_CHIDX_0                          (0x1U<<0)
#define RADIO_PUBLISH_DISABLED_EN_DISABLED                      (0x0U<<31)
#define RADIO_PUBLISH_DISABLED_EN_ENABLED                       (0x1U<<31)

// PUBLISH_DEVMATCH Configuration

#define RADIO_PUBLISH_DEVMATCH_EN                               (0x1U<<31)
#define RADIO_PUBLISH_DEVMATCH_CHIDX                            (0xFFU<<0)
#define RADIO_PUBLISH_DEVMATCH_CHIDX_0                          (0x1U<<0)
#define RADIO_PUBLISH_DEVMATCH_EN_DISABLED                      (0x0U<<31)
#define RADIO_PUBLISH_DEVMATCH_EN_ENABLED                       (0x1U<<31)

// PUBLISH_DEVMISS Configuration

#define RADIO_PUBLISH_DEVMISS_EN                                (0x1U<<31)
#define RADIO_PUBLISH_DEVMISS_CHIDX                             (0xFFU<<0)
#define RADIO_PUBLISH_DEVMISS_CHIDX_0                           (0x1U<<0)
#define RADIO_PUBLISH_DEVMISS_EN_DISABLED                       (0x0U<<31)
#define RADIO_PUBLISH_DEVMISS_EN_ENABLED                        (0x1U<<31)

// PUBLISH_RSSIEND Configuration

#define RADIO_PUBLISH_RSSIEND_EN                                (0x1U<<31)
#define RADIO_PUBLISH_RSSIEND_CHIDX                             (0xFFU<<0)
#define RADIO_PUBLISH_RSSIEND_CHIDX_0                           (0x1U<<0)
#define RADIO_PUBLISH_RSSIEND_EN_DISABLED                       (0x0U<<31)
#define RADIO_PUBLISH_RSSIEND_EN_ENABLED                        (0x1U<<31)

// PUBLISH_BCMATCH Configuration

#define RADIO_PUBLISH_BCMATCH_EN                                (0x1U<<31)
#define RADIO_PUBLISH_BCMATCH_CHIDX                             (0xFFU<<0)
#define RADIO_PUBLISH_BCMATCH_CHIDX_0                           (0x1U<<0)
#define RADIO_PUBLISH_BCMATCH_EN_DISABLED                       (0x0U<<31)
#define RADIO_PUBLISH_BCMATCH_EN_ENABLED                        (0x1U<<31)

// PUBLISH_CRCOK Configuration

#define RADIO_PUBLISH_CRCOK_EN                                  (0x1U<<31)
#define RADIO_PUBLISH_CRCOK_CHIDX                               (0xFFU<<0)
#define RADIO_PUBLISH_CRCOK_CHIDX_0                             (0x1U<<0)
#define RADIO_PUBLISH_CRCOK_EN_DISABLED                         (0x0U<<31)
#define RADIO_PUBLISH_CRCOK_EN_ENABLED                          (0x1U<<31)

// PUBLISH_CRCERROR Configuration

#define RADIO_PUBLISH_CRCERROR_EN                               (0x1U<<31)
#define RADIO_PUBLISH_CRCERROR_CHIDX                            (0xFFU<<0)
#define RADIO_PUBLISH_CRCERROR_CHIDX_0                          (0x1U<<0)
#define RADIO_PUBLISH_CRCERROR_EN_DISABLED                      (0x0U<<31)
#define RADIO_PUBLISH_CRCERROR_EN_ENABLED                       (0x1U<<31)

// PUBLISH_FRAMESTART Configuration

#define RADIO_PUBLISH_FRAMESTART_EN                             (0x1U<<31)
#define RADIO_PUBLISH_FRAMESTART_CHIDX                          (0xFFU<<0)
#define RADIO_PUBLISH_FRAMESTART_CHIDX_0                        (0x1U<<0)
#define RADIO_PUBLISH_FRAMESTART_EN_DISABLED                    (0x0U<<31)
#define RADIO_PUBLISH_FRAMESTART_EN_ENABLED                     (0x1U<<31)

// PUBLISH_EDEND Configuration

#define RADIO_PUBLISH_EDEND_EN                                  (0x1U<<31)
#define RADIO_PUBLISH_EDEND_CHIDX                               (0xFFU<<0)
#define RADIO_PUBLISH_EDEND_CHIDX_0                             (0x1U<<0)
#define RADIO_PUBLISH_EDEND_EN_DISABLED                         (0x0U<<31)
#define RADIO_PUBLISH_EDEND_EN_ENABLED                          (0x1U<<31)

// PUBLISH_EDSTOPPED Configuration

#define RADIO_PUBLISH_EDSTOPPED_EN                              (0x1U<<31)
#define RADIO_PUBLISH_EDSTOPPED_CHIDX                           (0xFFU<<0)
#define RADIO_PUBLISH_EDSTOPPED_CHIDX_0                         (0x1U<<0)
#define RADIO_PUBLISH_EDSTOPPED_EN_DISABLED                     (0x0U<<31)
#define RADIO_PUBLISH_EDSTOPPED_EN_ENABLED                      (0x1U<<31)

// PUBLISH_CCAIDLE Configuration

#define RADIO_PUBLISH_CCAIDLE_EN                                (0x1U<<31)
#define RADIO_PUBLISH_CCAIDLE_CHIDX                             (0xFFU<<0)
#define RADIO_PUBLISH_CCAIDLE_CHIDX_0                           (0x1U<<0)
#define RADIO_PUBLISH_CCAIDLE_EN_DISABLED                       (0x0U<<31)
#define RADIO_PUBLISH_CCAIDLE_EN_ENABLED                        (0x1U<<31)

// PUBLISH_CCABUSY Configuration

#define RADIO_PUBLISH_CCABUSY_EN                                (0x1U<<31)
#define RADIO_PUBLISH_CCABUSY_CHIDX                             (0xFFU<<0)
#define RADIO_PUBLISH_CCABUSY_CHIDX_0                           (0x1U<<0)
#define RADIO_PUBLISH_CCABUSY_EN_DISABLED                       (0x0U<<31)
#define RADIO_PUBLISH_CCABUSY_EN_ENABLED                        (0x1U<<31)

// PUBLISH_CCASTOPPED Configuration

#define RADIO_PUBLISH_CCASTOPPED_EN                             (0x1U<<31)
#define RADIO_PUBLISH_CCASTOPPED_CHIDX                          (0xFFU<<0)
#define RADIO_PUBLISH_CCASTOPPED_CHIDX_0                        (0x1U<<0)
#define RADIO_PUBLISH_CCASTOPPED_EN_DISABLED                    (0x0U<<31)
#define RADIO_PUBLISH_CCASTOPPED_EN_ENABLED                     (0x1U<<31)

// PUBLISH_RATEBOOST Configuration

#define RADIO_PUBLISH_RATEBOOST_EN                              (0x1U<<31)
#define RADIO_PUBLISH_RATEBOOST_CHIDX                           (0xFFU<<0)
#define RADIO_PUBLISH_RATEBOOST_CHIDX_0                         (0x1U<<0)
#define RADIO_PUBLISH_RATEBOOST_EN_DISABLED                     (0x0U<<31)
#define RADIO_PUBLISH_RATEBOOST_EN_ENABLED                      (0x1U<<31)

// PUBLISH_TXREADY Configuration

#define RADIO_PUBLISH_TXREADY_EN                                (0x1U<<31)
#define RADIO_PUBLISH_TXREADY_CHIDX                             (0xFFU<<0)
#define RADIO_PUBLISH_TXREADY_CHIDX_0                           (0x1U<<0)
#define RADIO_PUBLISH_TXREADY_EN_DISABLED                       (0x0U<<31)
#define RADIO_PUBLISH_TXREADY_EN_ENABLED                        (0x1U<<31)

// PUBLISH_RXREADY Configuration

