Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_radio.h
#define RADIO_PUBLISH_RXREADY_EN                                (0x1U<<31)
#define RADIO_PUBLISH_RXREADY_CHIDX                             (0xFFU<<0)
#define RADIO_PUBLISH_RXREADY_CHIDX_0                           (0x1U<<0)
#define RADIO_PUBLISH_RXREADY_EN_DISABLED                       (0x0U<<31)
#define RADIO_PUBLISH_RXREADY_EN_ENABLED                        (0x1U<<31)

// PUBLISH_MHRMATCH Configuration

#define RADIO_PUBLISH_MHRMATCH_EN                               (0x1U<<31)
#define RADIO_PUBLISH_MHRMATCH_CHIDX                            (0xFFU<<0)
#define RADIO_PUBLISH_MHRMATCH_CHIDX_0                          (0x1U<<0)
#define RADIO_PUBLISH_MHRMATCH_EN_DISABLED                      (0x0U<<31)
#define RADIO_PUBLISH_MHRMATCH_EN_ENABLED                       (0x1U<<31)

// PUBLISH_SYNC Configuration

#define RADIO_PUBLISH_SYNC_EN                                   (0x1U<<31)
#define RADIO_PUBLISH_SYNC_CHIDX                                (0xFFU<<0)
#define RADIO_PUBLISH_SYNC_CHIDX_0                              (0x1U<<0)
#define RADIO_PUBLISH_SYNC_EN_DISABLED                          (0x0U<<31)
#define RADIO_PUBLISH_SYNC_EN_ENABLED                           (0x1U<<31)

// PUBLISH_PHYEND Configuration

#define RADIO_PUBLISH_PHYEND_EN                                 (0x1U<<31)
#define RADIO_PUBLISH_PHYEND_CHIDX                              (0xFFU<<0)
#define RADIO_PUBLISH_PHYEND_CHIDX_0                            (0x1U<<0)
#define RADIO_PUBLISH_PHYEND_EN_DISABLED                        (0x0U<<31)
#define RADIO_PUBLISH_PHYEND_EN_ENABLED                         (0x1U<<31)

// PUBLISH_CTEPRESENT Configuration

#define RADIO_PUBLISH_CTEPRESENT_EN                             (0x1U<<31)
#define RADIO_PUBLISH_CTEPRESENT_CHIDX                          (0xFFU<<0)
#define RADIO_PUBLISH_CTEPRESENT_CHIDX_0                        (0x1U<<0)
#define RADIO_PUBLISH_CTEPRESENT_EN_DISABLED                    (0x0U<<31)
#define RADIO_PUBLISH_CTEPRESENT_EN_ENABLED                     (0x1U<<31)

// SHORTS Configuration

#define RADIO_SHORTS_PHYEND_START                               (0x1U<<21)
#define RADIO_SHORTS_PHYEND_DISABLE                             (0x1U<<20)
#define RADIO_SHORTS_RXREADY_START                              (0x1U<<19)
#define RADIO_SHORTS_TXREADY_START                              (0x1U<<18)
#define RADIO_SHORTS_CCAIDLE_STOP                               (0x1U<<17)
#define RADIO_SHORTS_EDEND_DISABLE                              (0x1U<<16)
#define RADIO_SHORTS_READY_EDSTART                              (0x1U<<15)
#define RADIO_SHORTS_FRAMESTART_BCSTART                         (0x1U<<14)
#define RADIO_SHORTS_CCABUSY_DISABLE                            (0x1U<<13)
#define RADIO_SHORTS_CCAIDLE_TXEN                               (0x1U<<12)
#define RADIO_SHORTS_RXREADY_CCASTART                           (0x1U<<11)
#define RADIO_SHORTS_DISABLED_RSSISTOP                          (0x1U<<8)
#define RADIO_SHORTS_ADDRESS_BCSTART                            (0x1U<<6)
#define RADIO_SHORTS_END_START                                  (0x1U<<5)
#define RADIO_SHORTS_ADDRESS_RSSISTART                          (0x1U<<4)
#define RADIO_SHORTS_DISABLED_RXEN                              (0x1U<<3)
#define RADIO_SHORTS_DISABLED_TXEN                              (0x1U<<2)
#define RADIO_SHORTS_END_DISABLE                                (0x1U<<1)
#define RADIO_SHORTS_READY_START                                (0x1U<<0)
#define RADIO_SHORTS_PHYEND_START_DISABLED                      (0x0U<<21)
#define RADIO_SHORTS_PHYEND_START_ENABLED                       (0x1U<<21)
#define RADIO_SHORTS_PHYEND_DISABLE_DISABLED                    (0x0U<<20)
#define RADIO_SHORTS_PHYEND_DISABLE_ENABLED                     (0x1U<<20)
#define RADIO_SHORTS_RXREADY_START_DISABLED                     (0x0U<<19)
#define RADIO_SHORTS_RXREADY_START_ENABLED                      (0x1U<<19)
#define RADIO_SHORTS_TXREADY_START_DISABLED                     (0x0U<<18)
#define RADIO_SHORTS_TXREADY_START_ENABLED                      (0x1U<<18)
#define RADIO_SHORTS_CCAIDLE_STOP_DISABLED                      (0x0U<<17)
#define RADIO_SHORTS_CCAIDLE_STOP_ENABLED                       (0x1U<<17)
#define RADIO_SHORTS_EDEND_DISABLE_DISABLED                     (0x0U<<16)
#define RADIO_SHORTS_EDEND_DISABLE_ENABLED                      (0x1U<<16)
#define RADIO_SHORTS_READY_EDSTART_DISABLED                     (0x0U<<15)
#define RADIO_SHORTS_READY_EDSTART_ENABLED                      (0x1U<<15)
#define RADIO_SHORTS_FRAMESTART_BCSTART_DISABLED                (0x0U<<14)
#define RADIO_SHORTS_FRAMESTART_BCSTART_ENABLED                 (0x1U<<14)
#define RADIO_SHORTS_CCABUSY_DISABLE_DISABLED                   (0x0U<<13)
#define RADIO_SHORTS_CCABUSY_DISABLE_ENABLED                    (0x1U<<13)
#define RADIO_SHORTS_CCAIDLE_TXEN_DISABLED                      (0x0U<<12)
#define RADIO_SHORTS_CCAIDLE_TXEN_ENABLED                       (0x1U<<12)
#define RADIO_SHORTS_RXREADY_CCASTART_DISABLED                  (0x0U<<11)
#define RADIO_SHORTS_RXREADY_CCASTART_ENABLED                   (0x1U<<11)
#define RADIO_SHORTS_DISABLED_RSSISTOP_DISABLED                 (0x0U<<8)
#define RADIO_SHORTS_DISABLED_RSSISTOP_ENABLED                  (0x1U<<8)
#define RADIO_SHORTS_ADDRESS_BCSTART_DISABLED                   (0x0U<<6)
#define RADIO_SHORTS_ADDRESS_BCSTART_ENABLED                    (0x1U<<6)
#define RADIO_SHORTS_END_START_DISABLED                         (0x0U<<5)
#define RADIO_SHORTS_END_START_ENABLED                          (0x1U<<5)
#define RADIO_SHORTS_ADDRESS_RSSISTART_DISABLED                 (0x0U<<4)
#define RADIO_SHORTS_ADDRESS_RSSISTART_ENABLED                  (0x1U<<4)
#define RADIO_SHORTS_DISABLED_RXEN_DISABLED                     (0x0U<<3)
#define RADIO_SHORTS_DISABLED_RXEN_ENABLED                      (0x1U<<3)
#define RADIO_SHORTS_DISABLED_TXEN_DISABLED                     (0x0U<<2)
#define RADIO_SHORTS_DISABLED_TXEN_ENABLED                      (0x1U<<2)
#define RADIO_SHORTS_END_DISABLE_DISABLED                       (0x0U<<1)
#define RADIO_SHORTS_END_DISABLE_ENABLED                        (0x1U<<1)
#define RADIO_SHORTS_READY_START_DISABLED                       (0x0U<<0)
#define RADIO_SHORTS_READY_START_ENABLED                        (0x1U<<0)

