Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_radio.h
// INTENSET Configuration

#define RADIO_INTENSET_CTEPRESENT                               (0x1U<<28)
#define RADIO_INTENSET_PHYEND                                   (0x1U<<27)
#define RADIO_INTENSET_SYNC                                     (0x1U<<26)
#define RADIO_INTENSET_MHRMATCH                                 (0x1U<<23)
#define RADIO_INTENSET_RXREADY                                  (0x1U<<22)
#define RADIO_INTENSET_TXREADY                                  (0x1U<<21)
#define RADIO_INTENSET_RATEBOOST                                (0x1U<<20)
#define RADIO_INTENSET_CCASTOPPED                               (0x1U<<19)
#define RADIO_INTENSET_CCABUSY                                  (0x1U<<18)
#define RADIO_INTENSET_CCAIDLE                                  (0x1U<<17)
#define RADIO_INTENSET_EDSTOPPED                                (0x1U<<16)
#define RADIO_INTENSET_EDEND                                    (0x1U<<15)
#define RADIO_INTENSET_FRAMESTART                               (0x1U<<14)
#define RADIO_INTENSET_CRCERROR                                 (0x1U<<13)
#define RADIO_INTENSET_CRCOK                                    (0x1U<<12)
#define RADIO_INTENSET_BCMATCH                                  (0x1U<<10)
#define RADIO_INTENSET_RSSIEND                                  (0x1U<<7)
#define RADIO_INTENSET_DEVMISS                                  (0x1U<<6)
#define RADIO_INTENSET_DEVMATCH                                 (0x1U<<5)
#define RADIO_INTENSET_DISABLED                                 (0x1U<<4)
#define RADIO_INTENSET_END                                      (0x1U<<3)
#define RADIO_INTENSET_PAYLOAD                                  (0x1U<<2)
#define RADIO_INTENSET_ADDRESS                                  (0x1U<<1)
#define RADIO_INTENSET_READY                                    (0x1U<<0)
#define RADIO_INTENSET_CTEPRESENT_DISABLED                      (0x0U<<28)
#define RADIO_INTENSET_CTEPRESENT_ENABLED                       (0x1U<<28)
#define RADIO_INTENSET_CTEPRESENT_SET                           (0x1U<<28)
#define RADIO_INTENSET_PHYEND_DISABLED                          (0x0U<<27)
#define RADIO_INTENSET_PHYEND_ENABLED                           (0x1U<<27)
#define RADIO_INTENSET_PHYEND_SET                               (0x1U<<27)
#define RADIO_INTENSET_SYNC_DISABLED                            (0x0U<<26)
#define RADIO_INTENSET_SYNC_ENABLED                             (0x1U<<26)
#define RADIO_INTENSET_SYNC_SET                                 (0x1U<<26)
#define RADIO_INTENSET_MHRMATCH_DISABLED                        (0x0U<<23)
#define RADIO_INTENSET_MHRMATCH_ENABLED                         (0x1U<<23)
#define RADIO_INTENSET_MHRMATCH_SET                             (0x1U<<23)
#define RADIO_INTENSET_RXREADY_DISABLED                         (0x0U<<22)
#define RADIO_INTENSET_RXREADY_ENABLED                          (0x1U<<22)
#define RADIO_INTENSET_RXREADY_SET                              (0x1U<<22)
#define RADIO_INTENSET_TXREADY_DISABLED                         (0x0U<<21)
#define RADIO_INTENSET_TXREADY_ENABLED                          (0x1U<<21)
#define RADIO_INTENSET_TXREADY_SET                              (0x1U<<21)
#define RADIO_INTENSET_RATEBOOST_DISABLED                       (0x0U<<20)
#define RADIO_INTENSET_RATEBOOST_ENABLED                        (0x1U<<20)
#define RADIO_INTENSET_RATEBOOST_SET                            (0x1U<<20)
#define RADIO_INTENSET_CCASTOPPED_DISABLED                      (0x0U<<19)
#define RADIO_INTENSET_CCASTOPPED_ENABLED                       (0x1U<<19)
#define RADIO_INTENSET_CCASTOPPED_SET                           (0x1U<<19)
#define RADIO_INTENSET_CCABUSY_DISABLED                         (0x0U<<18)
#define RADIO_INTENSET_CCABUSY_ENABLED                          (0x1U<<18)
#define RADIO_INTENSET_CCABUSY_SET                              (0x1U<<18)
#define RADIO_INTENSET_CCAIDLE_DISABLED                         (0x0U<<17)
#define RADIO_INTENSET_CCAIDLE_ENABLED                          (0x1U<<17)
#define RADIO_INTENSET_CCAIDLE_SET                              (0x1U<<17)
#define RADIO_INTENSET_EDSTOPPED_DISABLED                       (0x0U<<16)
#define RADIO_INTENSET_EDSTOPPED_ENABLED                        (0x1U<<16)
#define RADIO_INTENSET_EDSTOPPED_SET                            (0x1U<<16)
#define RADIO_INTENSET_EDEND_DISABLED                           (0x0U<<15)
#define RADIO_INTENSET_EDEND_ENABLED                            (0x1U<<15)
#define RADIO_INTENSET_EDEND_SET                                (0x1U<<15)
#define RADIO_INTENSET_FRAMESTART_DISABLED                      (0x0U<<14)
#define RADIO_INTENSET_FRAMESTART_ENABLED                       (0x1U<<14)
#define RADIO_INTENSET_FRAMESTART_SET                           (0x1U<<14)
#define RADIO_INTENSET_CRCERROR_DISABLED                        (0x0U<<13)
#define RADIO_INTENSET_CRCERROR_ENABLED                         (0x1U<<13)
#define RADIO_INTENSET_CRCERROR_SET                             (0x1U<<13)
#define RADIO_INTENSET_CRCOK_DISABLED                           (0x0U<<12)
#define RADIO_INTENSET_CRCOK_ENABLED                            (0x1U<<12)
#define RADIO_INTENSET_CRCOK_SET                                (0x1U<<12)
#define RADIO_INTENSET_BCMATCH_DISABLED                         (0x0U<<10)
#define RADIO_INTENSET_BCMATCH_ENABLED                          (0x1U<<10)
#define RADIO_INTENSET_BCMATCH_SET                              (0x1U<<10)
#define RADIO_INTENSET_RSSIEND_DISABLED                         (0x0U<<7)
#define RADIO_INTENSET_RSSIEND_ENABLED                          (0x1U<<7)
#define RADIO_INTENSET_RSSIEND_SET                              (0x1U<<7)
#define RADIO_INTENSET_DEVMISS_DISABLED                         (0x0U<<6)
#define RADIO_INTENSET_DEVMISS_ENABLED                          (0x1U<<6)
#define RADIO_INTENSET_DEVMISS_SET                              (0x1U<<6)
#define RADIO_INTENSET_DEVMATCH_DISABLED                        (0x0U<<5)
#define RADIO_INTENSET_DEVMATCH_ENABLED                         (0x1U<<5)
#define RADIO_INTENSET_DEVMATCH_SET                             (0x1U<<5)
#define RADIO_INTENSET_DISABLED_DISABLED                        (0x0U<<4)
#define RADIO_INTENSET_DISABLED_ENABLED                         (0x1U<<4)
#define RADIO_INTENSET_DISABLED_SET                             (0x1U<<4)
#define RADIO_INTENSET_END_DISABLED                             (0x0U<<3)
#define RADIO_INTENSET_END_ENABLED                              (0x1U<<3)
#define RADIO_INTENSET_END_SET                                  (0x1U<<3)
#define RADIO_INTENSET_PAYLOAD_DISABLED                         (0x0U<<2)
#define RADIO_INTENSET_PAYLOAD_ENABLED                          (0x1U<<2)
#define RADIO_INTENSET_PAYLOAD_SET                              (0x1U<<2)
#define RADIO_INTENSET_ADDRESS_DISABLED                         (0x0U<<1)
#define RADIO_INTENSET_ADDRESS_ENABLED                          (0x1U<<1)
#define RADIO_INTENSET_ADDRESS_SET                              (0x1U<<1)
#define RADIO_INTENSET_READY_DISABLED                           (0x0U<<0)
#define RADIO_INTENSET_READY_ENABLED                            (0x1U<<0)
#define RADIO_INTENSET_READY_SET                                (0x1U<<0)

// INTENCLR Configuration

