Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_radio.h
#define RADIO_INTENCLR_CTEPRESENT                               (0x1U<<28)
#define RADIO_INTENCLR_PHYEND                                   (0x1U<<27)
#define RADIO_INTENCLR_SYNC                                     (0x1U<<26)
#define RADIO_INTENCLR_MHRMATCH                                 (0x1U<<23)
#define RADIO_INTENCLR_RXREADY                                  (0x1U<<22)
#define RADIO_INTENCLR_TXREADY                                  (0x1U<<21)
#define RADIO_INTENCLR_RATEBOOST                                (0x1U<<20)
#define RADIO_INTENCLR_CCASTOPPED                               (0x1U<<19)
#define RADIO_INTENCLR_CCABUSY                                  (0x1U<<18)
#define RADIO_INTENCLR_CCAIDLE                                  (0x1U<<17)
#define RADIO_INTENCLR_EDSTOPPED                                (0x1U<<16)
#define RADIO_INTENCLR_EDEND                                    (0x1U<<15)
#define RADIO_INTENCLR_FRAMESTART                               (0x1U<<14)
#define RADIO_INTENCLR_CRCERROR                                 (0x1U<<13)
#define RADIO_INTENCLR_CRCOK                                    (0x1U<<12)
#define RADIO_INTENCLR_BCMATCH                                  (0x1U<<10)
#define RADIO_INTENCLR_RSSIEND                                  (0x1U<<7)
#define RADIO_INTENCLR_DEVMISS                                  (0x1U<<6)
#define RADIO_INTENCLR_DEVMATCH                                 (0x1U<<5)
#define RADIO_INTENCLR_DISABLED                                 (0x1U<<4)
#define RADIO_INTENCLR_END                                      (0x1U<<3)
#define RADIO_INTENCLR_PAYLOAD                                  (0x1U<<2)
#define RADIO_INTENCLR_ADDRESS                                  (0x1U<<1)
#define RADIO_INTENCLR_READY                                    (0x1U<<0)
#define RADIO_INTENCLR_CTEPRESENT_DISABLED                      (0x0U<<28)
#define RADIO_INTENCLR_CTEPRESENT_ENABLED                       (0x1U<<28)
#define RADIO_INTENCLR_CTEPRESENT_CLEAR                         (0x1U<<28)
#define RADIO_INTENCLR_PHYEND_DISABLED                          (0x0U<<27)
#define RADIO_INTENCLR_PHYEND_ENABLED                           (0x1U<<27)
#define RADIO_INTENCLR_PHYEND_CLEAR                             (0x1U<<27)
#define RADIO_INTENCLR_SYNC_DISABLED                            (0x0U<<26)
#define RADIO_INTENCLR_SYNC_ENABLED                             (0x1U<<26)
#define RADIO_INTENCLR_SYNC_CLEAR                               (0x1U<<26)
#define RADIO_INTENCLR_MHRMATCH_DISABLED                        (0x0U<<23)
#define RADIO_INTENCLR_MHRMATCH_ENABLED                         (0x1U<<23)
#define RADIO_INTENCLR_MHRMATCH_CLEAR                           (0x1U<<23)
#define RADIO_INTENCLR_RXREADY_DISABLED                         (0x0U<<22)
#define RADIO_INTENCLR_RXREADY_ENABLED                          (0x1U<<22)
#define RADIO_INTENCLR_RXREADY_CLEAR                            (0x1U<<22)
#define RADIO_INTENCLR_TXREADY_DISABLED                         (0x0U<<21)
#define RADIO_INTENCLR_TXREADY_ENABLED                          (0x1U<<21)
#define RADIO_INTENCLR_TXREADY_CLEAR                            (0x1U<<21)
#define RADIO_INTENCLR_RATEBOOST_DISABLED                       (0x0U<<20)
#define RADIO_INTENCLR_RATEBOOST_ENABLED                        (0x1U<<20)
#define RADIO_INTENCLR_RATEBOOST_CLEAR                          (0x1U<<20)
#define RADIO_INTENCLR_CCASTOPPED_DISABLED                      (0x0U<<19)
#define RADIO_INTENCLR_CCASTOPPED_ENABLED                       (0x1U<<19)
#define RADIO_INTENCLR_CCASTOPPED_CLEAR                         (0x1U<<19)
#define RADIO_INTENCLR_CCABUSY_DISABLED                         (0x0U<<18)
#define RADIO_INTENCLR_CCABUSY_ENABLED                          (0x1U<<18)
#define RADIO_INTENCLR_CCABUSY_CLEAR                            (0x1U<<18)
#define RADIO_INTENCLR_CCAIDLE_DISABLED                         (0x0U<<17)
#define RADIO_INTENCLR_CCAIDLE_ENABLED                          (0x1U<<17)
#define RADIO_INTENCLR_CCAIDLE_CLEAR                            (0x1U<<17)
#define RADIO_INTENCLR_EDSTOPPED_DISABLED                       (0x0U<<16)
#define RADIO_INTENCLR_EDSTOPPED_ENABLED                        (0x1U<<16)
#define RADIO_INTENCLR_EDSTOPPED_CLEAR                          (0x1U<<16)
#define RADIO_INTENCLR_EDEND_DISABLED                           (0x0U<<15)
#define RADIO_INTENCLR_EDEND_ENABLED                            (0x1U<<15)
#define RADIO_INTENCLR_EDEND_CLEAR                              (0x1U<<15)
#define RADIO_INTENCLR_FRAMESTART_DISABLED                      (0x0U<<14)
#define RADIO_INTENCLR_FRAMESTART_ENABLED                       (0x1U<<14)
#define RADIO_INTENCLR_FRAMESTART_CLEAR                         (0x1U<<14)
#define RADIO_INTENCLR_CRCERROR_DISABLED                        (0x0U<<13)
#define RADIO_INTENCLR_CRCERROR_ENABLED                         (0x1U<<13)
#define RADIO_INTENCLR_CRCERROR_CLEAR                           (0x1U<<13)
#define RADIO_INTENCLR_CRCOK_DISABLED                           (0x0U<<12)
#define RADIO_INTENCLR_CRCOK_ENABLED                            (0x1U<<12)
#define RADIO_INTENCLR_CRCOK_CLEAR                              (0x1U<<12)
#define RADIO_INTENCLR_BCMATCH_DISABLED                         (0x0U<<10)
#define RADIO_INTENCLR_BCMATCH_ENABLED                          (0x1U<<10)
#define RADIO_INTENCLR_BCMATCH_CLEAR                            (0x1U<<10)
#define RADIO_INTENCLR_RSSIEND_DISABLED                         (0x0U<<7)
#define RADIO_INTENCLR_RSSIEND_ENABLED                          (0x1U<<7)
#define RADIO_INTENCLR_RSSIEND_CLEAR                            (0x1U<<7)
#define RADIO_INTENCLR_DEVMISS_DISABLED                         (0x0U<<6)
#define RADIO_INTENCLR_DEVMISS_ENABLED                          (0x1U<<6)
#define RADIO_INTENCLR_DEVMISS_CLEAR                            (0x1U<<6)
#define RADIO_INTENCLR_DEVMATCH_DISABLED                        (0x0U<<5)
#define RADIO_INTENCLR_DEVMATCH_ENABLED                         (0x1U<<5)
#define RADIO_INTENCLR_DEVMATCH_CLEAR                           (0x1U<<5)
#define RADIO_INTENCLR_DISABLED_DISABLED                        (0x0U<<4)
#define RADIO_INTENCLR_DISABLED_ENABLED                         (0x1U<<4)
#define RADIO_INTENCLR_DISABLED_CLEAR                           (0x1U<<4)
#define RADIO_INTENCLR_END_DISABLED                             (0x0U<<3)
#define RADIO_INTENCLR_END_ENABLED                              (0x1U<<3)
#define RADIO_INTENCLR_END_CLEAR                                (0x1U<<3)
#define RADIO_INTENCLR_PAYLOAD_DISABLED                         (0x0U<<2)
#define RADIO_INTENCLR_PAYLOAD_ENABLED                          (0x1U<<2)
#define RADIO_INTENCLR_PAYLOAD_CLEAR                            (0x1U<<2)
#define RADIO_INTENCLR_ADDRESS_DISABLED                         (0x0U<<1)
#define RADIO_INTENCLR_ADDRESS_ENABLED                          (0x1U<<1)
#define RADIO_INTENCLR_ADDRESS_CLEAR                            (0x1U<<1)
#define RADIO_INTENCLR_READY_DISABLED                           (0x0U<<0)
#define RADIO_INTENCLR_READY_ENABLED                            (0x1U<<0)
#define RADIO_INTENCLR_READY_CLEAR                              (0x1U<<0)

// CRCSTATUS Configuration

#define RADIO_CRCSTATUS_CRCSTATUS                               (0x1U<<0)
#define RADIO_CRCSTATUS_CRCSTATUS_CRCERROR                      (0x0U<<0)
#define RADIO_CRCSTATUS_CRCSTATUS_CRCOK                         (0x1U<<0)

// RXMATCH Configuration

#define RADIO_RXMATCH_RXMATCH                                   (0x7U<<0)
#define RADIO_RXMATCH_RXMATCH_0                                 (0x1U<<0)

// RXCRC Configuration

#define RADIO_RXCRC_RXCRC                                       (0xFFFFFFU<<0)
#define RADIO_RXCRC_RXCRC_0                                     (0x1U<<0)

// DAI Configuration

#define RADIO_DAI_DAI                                           (0x7U<<0)
#define RADIO_DAI_DAI_0                                         (0x1U<<0)

