Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_radio.h
// PDUSTAT Configuration

#define RADIO_PDUSTAT_CISTAT                                    (0x3U<<1)
#define RADIO_PDUSTAT_CISTAT_0                                  (0x1U<<1)
#define RADIO_PDUSTAT_PDUSTAT                                   (0x1U<<0)
#define RADIO_PDUSTAT_CISTAT_LR125KBIT                          (0x0U<<1)
#define RADIO_PDUSTAT_CISTAT_LR500KBIT                          (0x1U<<1)
#define RADIO_PDUSTAT_PDUSTAT_LESSTHAN                          (0x0U<<0)
#define RADIO_PDUSTAT_PDUSTAT_GREATERTHAN                       (0x1U<<0)

// CTESTATUS Configuration

#define RADIO_CTESTATUS_CTETYPE                                 (0x3U<<6)
#define RADIO_CTESTATUS_CTETYPE_0                               (0x1U<<6)
#define RADIO_CTESTATUS_RFU                                     (0x1U<<5)
#define RADIO_CTESTATUS_CTETIME                                 (0x1FU<<0)
#define RADIO_CTESTATUS_CTETIME_0                               (0x1U<<0)

// DFESTATUS Configuration

#define RADIO_DFESTATUS_SAMPLINGSTATE                           (0x1U<<4)
#define RADIO_DFESTATUS_SWITCHINGSTATE                          (0x7U<<0)
#define RADIO_DFESTATUS_SWITCHINGSTATE_0                        (0x1U<<0)
#define RADIO_DFESTATUS_SAMPLINGSTATE_IDLE                      (0x0U<<4)
#define RADIO_DFESTATUS_SAMPLINGSTATE_SAMPLING                  (0x1U<<4)
#define RADIO_DFESTATUS_SWITCHINGSTATE_IDLE                     (0x0U<<0)
#define RADIO_DFESTATUS_SWITCHINGSTATE_OFFSET                   (0x1U<<0)
#define RADIO_DFESTATUS_SWITCHINGSTATE_GUARD                    (0x2U<<0)
#define RADIO_DFESTATUS_SWITCHINGSTATE_REF                      (0x3U<<0)
#define RADIO_DFESTATUS_SWITCHINGSTATE_SWITCHING                (0x4U<<0)
#define RADIO_DFESTATUS_SWITCHINGSTATE_ENDING                   (0x5U<<0)

// PACKETPTR Configuration

#define RADIO_PACKETPTR_PACKETPTR                               (0xFFFFFFFFU<<0)
#define RADIO_PACKETPTR_PACKETPTR_0                             (0x1U<<0)

// FREQUENCY Configuration

#define RADIO_FREQUENCY_MAP                                     (0x1U<<8)
#define RADIO_FREQUENCY_FREQUENCY                               (0x7FU<<0)
#define RADIO_FREQUENCY_FREQUENCY_0                             (0x1U<<0)
#define RADIO_FREQUENCY_MAP_DEFAULT                             (0x0U<<8)
#define RADIO_FREQUENCY_MAP_LOW                                 (0x1U<<8)

// TXPOWER Configuration

#define RADIO_TXPOWER_TXPOWER                                   (0xFFU<<0)
#define RADIO_TXPOWER_TXPOWER_0                                 (0x1U<<0)
#define RADIO_TXPOWER_TXPOWER_0DBM                              (0x0U<<0)
#define RADIO_TXPOWER_TXPOWER_NEG1DBM                           (0xFFU<<0)
#define RADIO_TXPOWER_TXPOWER_NEG2DBM                           (0xFEU<<0)
#define RADIO_TXPOWER_TXPOWER_NEG3DBM                           (0xFDU<<0)
#define RADIO_TXPOWER_TXPOWER_NEG4DBM                           (0xFCU<<0)
#define RADIO_TXPOWER_TXPOWER_NEG5DBM                           (0xFBU<<0)
#define RADIO_TXPOWER_TXPOWER_NEG6DBM                           (0xFAU<<0)
#define RADIO_TXPOWER_TXPOWER_NEG7DBM                           (0xF9U<<0)
#define RADIO_TXPOWER_TXPOWER_NEG8DBM                           (0xF8U<<0)
#define RADIO_TXPOWER_TXPOWER_NEG12DBM                          (0xF4U<<0)
#define RADIO_TXPOWER_TXPOWER_NEG16DBM                          (0xF0U<<0)
#define RADIO_TXPOWER_TXPOWER_NEG20DBM                          (0xECU<<0)
#define RADIO_TXPOWER_TXPOWER_NEG30DBM                          (0xE2U<<0)
#define RADIO_TXPOWER_TXPOWER_NEG40DBM                          (0xD8U<<0)

// MODE Configuration

#define RADIO_MODE_MODE                                         (0xFU<<0)
#define RADIO_MODE_MODE_0                                       (0x1U<<0)
#define RADIO_MODE_MODE_NRF_1MBIT                               (0x0U<<0)
#define RADIO_MODE_MODE_NRF_2MBIT                               (0x1U<<0)
#define RADIO_MODE_MODE_BLE_1MBIT                               (0x3U<<0)
#define RADIO_MODE_MODE_BLE_2MBIT                               (0x4U<<0)
#define RADIO_MODE_MODE_BLE_LR125KBIT                           (0x5U<<0)
#define RADIO_MODE_MODE_BLE_LR500KBIT                           (0x6U<<0)
#define RADIO_MODE_MODE_IEEE802154_250KBIT                      (0xFU<<0)

// PCNF0 Configuration

#define RADIO_PCNF0_TERMLEN                                     (0x3U<<29)
#define RADIO_PCNF0_TERMLEN_0                                   (0x1U<<29)
#define RADIO_PCNF0_CRCINC                                      (0x1U<<26)
#define RADIO_PCNF0_PLEN                                        (0x3U<<24)
#define RADIO_PCNF0_PLEN_0                                      (0x1U<<24)
#define RADIO_PCNF0_CILEN                                       (0x3U<<22)
#define RADIO_PCNF0_CILEN_0                                     (0x1U<<22)
#define RADIO_PCNF0_S1INCL                                      (0x1U<<20)
#define RADIO_PCNF0_S1LEN                                       (0xFU<<16)
#define RADIO_PCNF0_S1LEN_0                                     (0x1U<<16)
#define RADIO_PCNF0_S0LEN                                       (0x1U<<8)
#define RADIO_PCNF0_LFLEN                                       (0xFU<<0)
#define RADIO_PCNF0_LFLEN_0                                     (0x1U<<0)
#define RADIO_PCNF0_CRCINC_EXCLUDE                              (0x0U<<26)
#define RADIO_PCNF0_CRCINC_INCLUDE                              (0x1U<<26)
#define RADIO_PCNF0_PLEN_8BIT                                   (0x0U<<24)
#define RADIO_PCNF0_PLEN_16BIT                                  (0x1U<<24)
#define RADIO_PCNF0_PLEN_32BITZERO                              (0x2U<<24)
#define RADIO_PCNF0_PLEN_LONGRANGE                              (0x3U<<24)
#define RADIO_PCNF0_S1INCL_AUTOMATIC                            (0x0U<<20)
#define RADIO_PCNF0_S1INCL_INCLUDE                              (0x1U<<20)

// PCNF1 Configuration

#define RADIO_PCNF1_WHITEEN                                     (0x1U<<25)
#define RADIO_PCNF1_ENDIAN                                      (0x1U<<24)
#define RADIO_PCNF1_BALEN                                       (0x7U<<16)
#define RADIO_PCNF1_BALEN_0                                     (0x1U<<16)
#define RADIO_PCNF1_STATLEN                                     (0xFFU<<8)
#define RADIO_PCNF1_STATLEN_0                                   (0x1U<<8)
#define RADIO_PCNF1_MAXLEN                                      (0xFFU<<0)
#define RADIO_PCNF1_MAXLEN_0                                    (0x1U<<0)
#define RADIO_PCNF1_WHITEEN_DISABLED                            (0x0U<<25)
#define RADIO_PCNF1_WHITEEN_ENABLED                             (0x1U<<25)
#define RADIO_PCNF1_ENDIAN_LITTLE                               (0x0U<<24)
#define RADIO_PCNF1_ENDIAN_BIG                                  (0x1U<<24)

// BASE0 Configuration

#define RADIO_BASE0_BASE0                                       (0xFFFFFFFFU<<0)
#define RADIO_BASE0_BASE0_0                                     (0x1U<<0)

// BASE1 Configuration

#define RADIO_BASE1_BASE1                                       (0xFFFFFFFFU<<0)
#define RADIO_BASE1_BASE1_0                                     (0x1U<<0)

// PREFIX0 Configuration

