Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_radio.h
#define RADIO_PREFIX0_AP3                                       (0xFFU<<24)
#define RADIO_PREFIX0_AP3_0                                     (0x1U<<24)
#define RADIO_PREFIX0_AP2                                       (0xFFU<<16)
#define RADIO_PREFIX0_AP2_0                                     (0x1U<<16)
#define RADIO_PREFIX0_AP1                                       (0xFFU<<8)
#define RADIO_PREFIX0_AP1_0                                     (0x1U<<8)
#define RADIO_PREFIX0_AP0                                       (0xFFU<<0)
#define RADIO_PREFIX0_AP0_0                                     (0x1U<<0)

// PREFIX1 Configuration

#define RADIO_PREFIX1_AP7                                       (0xFFU<<24)
#define RADIO_PREFIX1_AP7_0                                     (0x1U<<24)
#define RADIO_PREFIX1_AP6                                       (0xFFU<<16)
#define RADIO_PREFIX1_AP6_0                                     (0x1U<<16)
#define RADIO_PREFIX1_AP5                                       (0xFFU<<8)
#define RADIO_PREFIX1_AP5_0                                     (0x1U<<8)
#define RADIO_PREFIX1_AP4                                       (0xFFU<<0)
#define RADIO_PREFIX1_AP4_0                                     (0x1U<<0)

// TXADDRESS Configuration

#define RADIO_TXADDRESS_TXADDRESS                               (0x7U<<0)
#define RADIO_TXADDRESS_TXADDRESS_0                             (0x1U<<0)

// RXADDRESSES Configuration

#define RADIO_RXADDRESSES_ADDR7                                 (0x1U<<7)
#define RADIO_RXADDRESSES_ADDR6                                 (0x1U<<6)
#define RADIO_RXADDRESSES_ADDR5                                 (0x1U<<5)
#define RADIO_RXADDRESSES_ADDR4                                 (0x1U<<4)
#define RADIO_RXADDRESSES_ADDR3                                 (0x1U<<3)
#define RADIO_RXADDRESSES_ADDR2                                 (0x1U<<2)
#define RADIO_RXADDRESSES_ADDR1                                 (0x1U<<1)
#define RADIO_RXADDRESSES_ADDR0                                 (0x1U<<0)
#define RADIO_RXADDRESSES_ADDR7_DISABLED                        (0x0U<<7)
#define RADIO_RXADDRESSES_ADDR7_ENABLED                         (0x1U<<7)
#define RADIO_RXADDRESSES_ADDR6_DISABLED                        (0x0U<<6)
#define RADIO_RXADDRESSES_ADDR6_ENABLED                         (0x1U<<6)
#define RADIO_RXADDRESSES_ADDR5_DISABLED                        (0x0U<<5)
#define RADIO_RXADDRESSES_ADDR5_ENABLED                         (0x1U<<5)
#define RADIO_RXADDRESSES_ADDR4_DISABLED                        (0x0U<<4)
#define RADIO_RXADDRESSES_ADDR4_ENABLED                         (0x1U<<4)
#define RADIO_RXADDRESSES_ADDR3_DISABLED                        (0x0U<<3)
#define RADIO_RXADDRESSES_ADDR3_ENABLED                         (0x1U<<3)
#define RADIO_RXADDRESSES_ADDR2_DISABLED                        (0x0U<<2)
#define RADIO_RXADDRESSES_ADDR2_ENABLED                         (0x1U<<2)
#define RADIO_RXADDRESSES_ADDR1_DISABLED                        (0x0U<<1)
#define RADIO_RXADDRESSES_ADDR1_ENABLED                         (0x1U<<1)
#define RADIO_RXADDRESSES_ADDR0_DISABLED                        (0x0U<<0)
#define RADIO_RXADDRESSES_ADDR0_ENABLED                         (0x1U<<0)

// CRCCNF Configuration

#define RADIO_CRCCNF_SKIPADDR                                   (0x3U<<8)
#define RADIO_CRCCNF_SKIPADDR_0                                 (0x1U<<8)
#define RADIO_CRCCNF_LEN                                        (0x3U<<0)
#define RADIO_CRCCNF_LEN_0                                      (0x1U<<0)
#define RADIO_CRCCNF_SKIPADDR_INCLUDE                           (0x0U<<8)
#define RADIO_CRCCNF_SKIPADDR_SKIP                              (0x1U<<8)
#define RADIO_CRCCNF_SKIPADDR_IEEE802154                        (0x2U<<8)
#define RADIO_CRCCNF_LEN_DISABLED                               (0x0U<<0)
#define RADIO_CRCCNF_LEN_ONE                                    (0x1U<<0)
#define RADIO_CRCCNF_LEN_TWO                                    (0x2U<<0)
#define RADIO_CRCCNF_LEN_THREE                                  (0x3U<<0)

// CRCPOLY Configuration

#define RADIO_CRCPOLY_CRCPOLY                                   (0xFFFFFFU<<0)
#define RADIO_CRCPOLY_CRCPOLY_0                                 (0x1U<<0)

// CRCINIT Configuration

#define RADIO_CRCINIT_CRCINIT                                   (0xFFFFFFU<<0)
#define RADIO_CRCINIT_CRCINIT_0                                 (0x1U<<0)

// TIFS Configuration

#define RADIO_TIFS_TIFS                                         (0x3FFU<<0)
#define RADIO_TIFS_TIFS_0                                       (0x1U<<0)

// RSSISAMPLE Configuration

#define RADIO_RSSISAMPLE_RSSISAMPLE                             (0x7FU<<0)
#define RADIO_RSSISAMPLE_RSSISAMPLE_0                           (0x1U<<0)

// STATE Configuration

#define RADIO_STATE_STATE                                       (0xFU<<0)
#define RADIO_STATE_STATE_0                                     (0x1U<<0)
#define RADIO_STATE_STATE_DISABLED                              (0x0U<<0)
#define RADIO_STATE_STATE_RXRU                                  (0x1U<<0)
#define RADIO_STATE_STATE_RXIDLE                                (0x2U<<0)
#define RADIO_STATE_STATE_RX                                    (0x3U<<0)
#define RADIO_STATE_STATE_RXDISABLE                             (0x4U<<0)
#define RADIO_STATE_STATE_TXRU                                  (0x9U<<0)
#define RADIO_STATE_STATE_TXIDLE                                (0xAU<<0)
#define RADIO_STATE_STATE_TX                                    (0xBU<<0)
#define RADIO_STATE_STATE_TXDISABLE                             (0xCU<<0)

// DATAWHITEIV Configuration

#define RADIO_DATAWHITEIV_DATAWHITEIV                           (0x7FU<<0)
#define RADIO_DATAWHITEIV_DATAWHITEIV_0                         (0x1U<<0)

// BCC Configuration

#define RADIO_BCC_BCC                                           (0xFFFFFFFFU<<0)
#define RADIO_BCC_BCC_0                                         (0x1U<<0)

// DAB Configuration

#define RADIO_DAB_DAB                                           (0xFFFFFFFFU<<0)
#define RADIO_DAB_DAB_0                                         (0x1U<<0)

// DAP Configuration

