Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_radio.h
#define RADIO_DAP_DAP                                           (0xFFFFU<<0)
#define RADIO_DAP_DAP_0                                         (0x1U<<0)

// DACNF Configuration

#define RADIO_DACNF_TXADD7                                      (0x1U<<15)
#define RADIO_DACNF_TXADD6                                      (0x1U<<14)
#define RADIO_DACNF_TXADD5                                      (0x1U<<13)
#define RADIO_DACNF_TXADD4                                      (0x1U<<12)
#define RADIO_DACNF_TXADD3                                      (0x1U<<11)
#define RADIO_DACNF_TXADD2                                      (0x1U<<10)
#define RADIO_DACNF_TXADD1                                      (0x1U<<9)
#define RADIO_DACNF_TXADD0                                      (0x1U<<8)
#define RADIO_DACNF_ENA7                                        (0x1U<<7)
#define RADIO_DACNF_ENA6                                        (0x1U<<6)
#define RADIO_DACNF_ENA5                                        (0x1U<<5)
#define RADIO_DACNF_ENA4                                        (0x1U<<4)
#define RADIO_DACNF_ENA3                                        (0x1U<<3)
#define RADIO_DACNF_ENA2                                        (0x1U<<2)
#define RADIO_DACNF_ENA1                                        (0x1U<<1)
#define RADIO_DACNF_ENA0                                        (0x1U<<0)
#define RADIO_DACNF_ENA7_DISABLED                               (0x0U<<7)
#define RADIO_DACNF_ENA7_ENABLED                                (0x1U<<7)
#define RADIO_DACNF_ENA6_DISABLED                               (0x0U<<6)
#define RADIO_DACNF_ENA6_ENABLED                                (0x1U<<6)
#define RADIO_DACNF_ENA5_DISABLED                               (0x0U<<5)
#define RADIO_DACNF_ENA5_ENABLED                                (0x1U<<5)
#define RADIO_DACNF_ENA4_DISABLED                               (0x0U<<4)
#define RADIO_DACNF_ENA4_ENABLED                                (0x1U<<4)
#define RADIO_DACNF_ENA3_DISABLED                               (0x0U<<3)
#define RADIO_DACNF_ENA3_ENABLED                                (0x1U<<3)
#define RADIO_DACNF_ENA2_DISABLED                               (0x0U<<2)
#define RADIO_DACNF_ENA2_ENABLED                                (0x1U<<2)
#define RADIO_DACNF_ENA1_DISABLED                               (0x0U<<1)
#define RADIO_DACNF_ENA1_ENABLED                                (0x1U<<1)
#define RADIO_DACNF_ENA0_DISABLED                               (0x0U<<0)
#define RADIO_DACNF_ENA0_ENABLED                                (0x1U<<0)

// MHRMATCHCONF Configuration

#define RADIO_MHRMATCHCONF_MHRMATCHCONF                         (0xFFFFFFFFU<<0)
#define RADIO_MHRMATCHCONF_MHRMATCHCONF_0                       (0x1U<<0)

// MHRMATCHMAS Configuration

#define RADIO_MHRMATCHMAS_MHRMATCHMAS                           (0xFFFFFFFFU<<0)
#define RADIO_MHRMATCHMAS_MHRMATCHMAS_0                         (0x1U<<0)

// MODECNF0 Configuration

#define RADIO_MODECNF0_DTX                                      (0x3U<<8)
#define RADIO_MODECNF0_DTX_0                                    (0x1U<<8)
#define RADIO_MODECNF0_RU                                       (0x1U<<0)
#define RADIO_MODECNF0_DTX_B1                                   (0x0U<<8)
#define RADIO_MODECNF0_DTX_B0                                   (0x1U<<8)
#define RADIO_MODECNF0_DTX_CENTER                               (0x2U<<8)
#define RADIO_MODECNF0_RU_DEFAULT                               (0x0U<<0)
#define RADIO_MODECNF0_RU_FAST                                  (0x1U<<0)

// SFD Configuration

#define RADIO_SFD_SFD                                           (0xFFU<<0)
#define RADIO_SFD_SFD_0                                         (0x1U<<0)

// EDCNT Configuration

#define RADIO_EDCNT_EDCNT                                       (0x1FFFFFU<<0)
#define RADIO_EDCNT_EDCNT_0                                     (0x1U<<0)

// EDSAMPLE Configuration

#define RADIO_EDSAMPLE_EDLVL                                    (0xFFU<<0)
#define RADIO_EDSAMPLE_EDLVL_0                                  (0x1U<<0)

// CCACTRL Configuration

#define RADIO_CCACTRL_CCACORRCNT                                (0xFFU<<24)
#define RADIO_CCACTRL_CCACORRCNT_0                              (0x1U<<24)
#define RADIO_CCACTRL_CCACORRTHRES                              (0xFFU<<16)
#define RADIO_CCACTRL_CCACORRTHRES_0                            (0x1U<<16)
#define RADIO_CCACTRL_CCAEDTHRES                                (0xFFU<<8)
#define RADIO_CCACTRL_CCAEDTHRES_0                              (0x1U<<8)
#define RADIO_CCACTRL_CCAMODE                                   (0x7U<<0)
#define RADIO_CCACTRL_CCAMODE_0                                 (0x1U<<0)
#define RADIO_CCACTRL_CCAMODE_EDMODE                            (0x0U<<0)
#define RADIO_CCACTRL_CCAMODE_CARRIERMODE                       (0x1U<<0)
#define RADIO_CCACTRL_CCAMODE_CARRIERANDEDMODE                  (0x2U<<0)
#define RADIO_CCACTRL_CCAMODE_CARRIEROREDMODE                   (0x3U<<0)
#define RADIO_CCACTRL_CCAMODE_EDMODETEST1                       (0x4U<<0)

// DFEMODE Configuration

#define RADIO_DFEMODE_DFEOPMODE                                 (0x3U<<0)
#define RADIO_DFEMODE_DFEOPMODE_0                               (0x1U<<0)
#define RADIO_DFEMODE_DFEOPMODE_DISABLED                        (0x0U<<0)
#define RADIO_DFEMODE_DFEOPMODE_AOD                             (0x2U<<0)
#define RADIO_DFEMODE_DFEOPMODE_AOA                             (0x3U<<0)

// CTEINLINECONF Configuration

#define RADIO_CTEINLINECONF_S0MASK                              (0xFFU<<24)
#define RADIO_CTEINLINECONF_S0MASK_0                            (0x1U<<24)
#define RADIO_CTEINLINECONF_S0CONF                              (0xFFU<<16)
#define RADIO_CTEINLINECONF_S0CONF_0                            (0x1U<<16)
#define RADIO_CTEINLINECONF_CTEINLINERXMODE2US                  (0x7U<<13)
#define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_0                (0x1U<<13)
#define RADIO_CTEINLINECONF_CTEINLINERXMODE1US                  (0x7U<<10)
#define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_0                (0x1U<<10)
#define RADIO_CTEINLINECONF_CTETIMEVALIDRANGE                   (0x3U<<6)
#define RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_0                 (0x1U<<6)
#define RADIO_CTEINLINECONF_CTEERRORHANDLING                    (0x1U<<4)
#define RADIO_CTEINLINECONF_CTEINFOINS1                         (0x1U<<3)
#define RADIO_CTEINLINECONF_CTEINLINECTRLEN                     (0x1U<<0)
#define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_4US              (0x1U<<13)
#define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_2US              (0x2U<<13)
#define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_1US              (0x3U<<13)
#define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_500NS            (0x4U<<13)
#define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_250NS            (0x5U<<13)
#define RADIO_CTEINLINECONF_CTEINLINERXMODE2US_125NS            (0x6U<<13)
#define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_4US              (0x1U<<10)
#define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_2US              (0x2U<<10)
#define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_1US              (0x3U<<10)
#define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_500NS            (0x4U<<10)
#define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_250NS            (0x5U<<10)
#define RADIO_CTEINLINECONF_CTEINLINERXMODE1US_125NS            (0x6U<<10)
#define RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_20                (0x0U<<6)
#define RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_31                (0x1U<<6)
#define RADIO_CTEINLINECONF_CTETIMEVALIDRANGE_63                (0x2U<<6)
#define RADIO_CTEINLINECONF_CTEERRORHANDLING_YES                (0x1U<<4)
#define RADIO_CTEINLINECONF_CTEERRORHANDLING_NO                 (0x0U<<4)
#define RADIO_CTEINLINECONF_CTEINFOINS1_INS1                    (0x1U<<3)
#define RADIO_CTEINLINECONF_CTEINFOINS1_NOTINS1                 (0x0U<<3)
#define RADIO_CTEINLINECONF_CTEINLINECTRLEN_ENABLED             (0x1U<<0)
#define RADIO_CTEINLINECONF_CTEINLINECTRLEN_DISABLED            (0x0U<<0)

