Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/nRF5340/Includes/Registers/nrf5340_network_radio.h
// DFECTRL1 Configuration

#define RADIO_DFECTRL1_AGCBACKOFFGAIN                           (0xFU<<24)
#define RADIO_DFECTRL1_AGCBACKOFFGAIN_0                         (0x1U<<24)
#define RADIO_DFECTRL1_REPEATPATTERN                            (0xFU<<20)
#define RADIO_DFECTRL1_REPEATPATTERN_0                          (0x1U<<20)
#define RADIO_DFECTRL1_TSAMPLESPACING                           (0x7U<<16)
#define RADIO_DFECTRL1_TSAMPLESPACING_0                         (0x1U<<16)
#define RADIO_DFECTRL1_SAMPLETYPE                               (0x1U<<15)
#define RADIO_DFECTRL1_TSAMPLESPACINGREF                        (0x7U<<12)
#define RADIO_DFECTRL1_TSAMPLESPACINGREF_0                      (0x1U<<12)
#define RADIO_DFECTRL1_TSWITCHSPACING                           (0x7U<<8)
#define RADIO_DFECTRL1_TSWITCHSPACING_0                         (0x1U<<8)
#define RADIO_DFECTRL1_DFEINEXTENSION                           (0x1U<<7)
#define RADIO_DFECTRL1_NUMBEROF8US                              (0x3FU<<0)
#define RADIO_DFECTRL1_NUMBEROF8US_0                            (0x1U<<0)
#define RADIO_DFECTRL1_REPEATPATTERN_NOREPEAT                   (0x0U<<20)
#define RADIO_DFECTRL1_TSAMPLESPACING_4US                       (0x1U<<16)
#define RADIO_DFECTRL1_TSAMPLESPACING_2US                       (0x2U<<16)
#define RADIO_DFECTRL1_TSAMPLESPACING_1US                       (0x3U<<16)
#define RADIO_DFECTRL1_TSAMPLESPACING_500NS                     (0x4U<<16)
#define RADIO_DFECTRL1_TSAMPLESPACING_250NS                     (0x5U<<16)
#define RADIO_DFECTRL1_TSAMPLESPACING_125NS                     (0x6U<<16)
#define RADIO_DFECTRL1_SAMPLETYPE_IQ                            (0x0U<<15)
#define RADIO_DFECTRL1_SAMPLETYPE_MAGPHASE                      (0x1U<<15)
#define RADIO_DFECTRL1_TSAMPLESPACINGREF_4US                    (0x1U<<12)
#define RADIO_DFECTRL1_TSAMPLESPACINGREF_2US                    (0x2U<<12)
#define RADIO_DFECTRL1_TSAMPLESPACINGREF_1US                    (0x3U<<12)
#define RADIO_DFECTRL1_TSAMPLESPACINGREF_500NS                  (0x4U<<12)
#define RADIO_DFECTRL1_TSAMPLESPACINGREF_250NS                  (0x5U<<12)
#define RADIO_DFECTRL1_TSAMPLESPACINGREF_125NS                  (0x6U<<12)
#define RADIO_DFECTRL1_TSWITCHSPACING_4US                       (0x1U<<8)
#define RADIO_DFECTRL1_TSWITCHSPACING_2US                       (0x2U<<8)
#define RADIO_DFECTRL1_TSWITCHSPACING_1US                       (0x3U<<8)
#define RADIO_DFECTRL1_DFEINEXTENSION_CRC                       (0x1U<<7)
#define RADIO_DFECTRL1_DFEINEXTENSION_PAYLOAD                   (0x0U<<7)

// DFECTRL2 Configuration

#define RADIO_DFECTRL2_TSAMPLEOFFSET                            (0xFFFU<<16)
#define RADIO_DFECTRL2_TSAMPLEOFFSET_0                          (0x1U<<16)
#define RADIO_DFECTRL2_TSWITCHOFFSET                            (0x1FFFU<<0)
#define RADIO_DFECTRL2_TSWITCHOFFSET_0                          (0x1U<<0)

// SWITCHPATTERN Configuration

#define RADIO_SWITCHPATTERN_SWITCHPATTERN                       (0xFFU<<0)
#define RADIO_SWITCHPATTERN_SWITCHPATTERN_0                     (0x1U<<0)

// CLEARPATTERN Configuration

#define RADIO_CLEARPATTERN_CLEARPATTERN                         (0x1U<<0)
#define RADIO_CLEARPATTERN_CLEARPATTERN_CLEAR                   (0x1U<<0)

// DFEGPIO Configuration

#define RADIO_PSEL_DFEGPIO_CONNECT                              (0x1U<<31)
#define RADIO_PSEL_DFEGPIO_PORT                                 (0x1U<<5)
#define RADIO_PSEL_DFEGPIO_PIN                                  (0x1FU<<0)
#define RADIO_PSEL_DFEGPIO_PIN_0                                (0x1U<<0)
#define RADIO_PSEL_DFEGPIO_CONNECT_DISCONNECTED                 (0x1U<<31)
#define RADIO_PSEL_DFEGPIO_CONNECT_CONNECTED                    (0x0U<<31)

// PTR Configuration

#define RADIO_DFEPACKET_PTR_PTR                                 (0xFFFFFFFFU<<0)
#define RADIO_DFEPACKET_PTR_PTR_0                               (0x1U<<0)

// MAXCNT Configuration

#define RADIO_DFEPACKET_MAXCNT_MAXCNT                           (0x3FFFU<<0)
#define RADIO_DFEPACKET_MAXCNT_MAXCNT_0                         (0x1U<<0)

// AMOUNT Configuration

#define RADIO_DFEPACKET_AMOUNT_AMOUNT                           (0xFFFFU<<0)
#define RADIO_DFEPACKET_AMOUNT_AMOUNT_0                         (0x1U<<0)

// POWER Configuration

#define RADIO_POWER_POWER                                       (0x1U<<0)
#define RADIO_POWER_POWER_DISABLED                              (0x0U<<0)
#define RADIO_POWER_POWER_ENABLED                               (0x1U<<0)
